{
  "version": "1.7.1",
  "download_url": "https://updates.foodblogkitchen.de/foodblogkitchen-toolkit/archives/1.7.1.zip",
  "requires": "5.8.0",
  "tested": "5.9.2",
  "requires_php": "7.4",
  "last_updated": "2022-06-02 12:46:09",
  "sections": {
    "description": "Toolkit for your Foodblog to optimize your blog for search engines. Including a Recipe block for the Gutenberg editor.",
    "installation": "Upload the plugin to your blog, activate it, that's it!",
    "changelog": "<h3>1.7.1 - June 2, 2022</h3>\n<ul>\n<li>When pasting formatted content in the recipe block, the formatting is now removed too keep the markup clean and reduce formatting issues.</li>\n</ul>\n<h3>1.7.0 - April 11, 2022</h3>\n<ul>\n<li>You can now set the size in which images are displayed in the recipe block in the plugin settings. This allows you to use the ideal size for your theme.</li>\n</ul>\n<h3>1.6.4 - April 11, 2022</h3>\n<ul>\n<li>The display of times has now been fixed for some themes.</li>\n</ul>\n<h3>1.6.3 - March 27, 2022</h3>\n<ul>\n<li>The spacing in the Gutenberg editor is now displayed correctly again.</li>\n</ul>\n<h3>1.6.2 - March 27, 2022</h3>\n<ul>\n<li>There was an error when printing recipes on Android devices which is now fixed.</li>\n</ul>\n<h3>1.6.1 - March 21, 2022</h3>\n<ul>\n<li>The recipe and FAQ block was missing the formatting and linking options. These are now back.</li>\n</ul>\n<h3>1.6.0 - March 20, 2022</h3>\n<ul>\n<li>We have completely revised the print layout of recipes. Recipes are now printed in a nice layout on as few pages as possible.</li>\n<li>When the recipe is displayed on the screen of a Android smartphone or tablet, the screen is now no longer automatically turned off.</li>\n<li>You can now specify baking trays and square baking pans as a unit.</li>\n<li>We have built in spam bot detection against fake ratings.</li>\n</ul>\n<h3>1.5.5 - March 3, 2022</h3>\n<ul>\n<li>The recipe image was not printed with some themes</li>\n</ul>\n<h3>1.5.4 - March 7, 2021</h3>\n<ul>\n<li>Half Star Icons are now visible in the rating</li>\n</ul>\n<h3>1.5.3 - February 25, 2021</h3>\n<ul>\n<li>Fix broken Link in the Release Notes hint</li>\n<li>Fix conflict potential with other plugins</li>\n<li>Fix headline color in call to action section if you have selected a dark primary color</li>\n</ul>\n<h3>1.5.2 - February 25, 2021</h3>\n<ul>\n<li>Remove PHP error in the admin section</li>\n</ul>\n<h3>1.5.1 - February 22, 2021</h3>\n<ul>\n<li>Remove some styling issues in the recipe block</li>\n</ul>\n<h3>1.5.0 - February 21, 2021</h3>\n<ul>\n<li>Release notes page which informs you about new features in the plugin</li>\n<li>Utensils to your recipe block</li>\n<li>You can now group preparation steps in your recipe block</li>\n<li>springform pans are now supported as recipe unit</li>\n<li>Add Instagram CTA below your recipe</li>\n<li>Optimize Pinterest \"Pin it\"-Button for lazy loading plugins</li>\n<li>Hint for further settings below the recipe block</li>\n<li>Improved translations for Austrian and Swiss blogs</li>\n<li>Improved default styles of the recipe block</li>\n<li>Fix missing stylings for \"jump to recipe\" button</li>\n</ul>\n<h3>1.4.2 – February 10, 2021</h3>\n<ul>\n<li>Fix the \"Jump to recipe\" block to be only visible when the option in the settings is activated and there is no \"Jump to recipe\" block in the page.</li>\n</ul>\n<h3>1.4.1 – February 1, 2021</h3>\n<ul>\n<li>Fix translation issues.</li>\n</ul>\n<h3>1.4.0 – January 30, 2021</h3>\n<ul>\n<li>Add Pinterest image overlay. This can be disabled in the settings.</li>\n<li>Add \"Jump to recipe\" block.</li>\n<li>Add \"Jump to recipe\" block automatically on every post with a recipe block. This can be disabled in the settings.</li>\n<li>Add \"FAQ\" block.</li>\n<li>You can now split up your ingredient lists in multiple groups.</li>\n<li>Remove \"Sample License\" page in settings menu</li>\n</ul>\n<h3>1.3.0 – January 17, 2021</h3>\n<ul>\n<li>Show correct domain URL in seo preview</li>\n<li>Update the default alignment for the preparation step list</li>\n<li>Move field for pinterest image to the recipe block settings</li>\n<li>Add possibility to upload a video to recipe block</li>\n<li>Add baking time to recipe block</li>\n<li>Show hint in seo preview that Google will create a custom preview text</li>\n</ul>\n<h3>1.2.0 – January 16, 2021</h3>\n<ul>\n<li>Fix an issue that HTML characters are sometimes visible in the notes.</li>\n<li>Fix an issue that the stars in the rating are sometimes not visible</li>\n<li>Add print button to recipe block</li>\n<li>Add possibility to add a pinterest image to the page</li>\n<li>Small technical bugfixes</li>\n</ul>\n<h3>1.1.0 – December 22, 2020</h3>\n<ul>\n<li>Change the main image to the aspect ratio of 3:2</li>\n<li>Add link to foodblogkitchens blog to give more information about selecting the right images.</li>\n</ul>\n<h3>1.0.3 – December 19, 2020</h3>\n<ul>\n<li>Initial release</li>\n</ul>"
  }
}